Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.LoadCaseType Property
 The load case type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisResult.LoadCaseTypeEnum LoadCaseType { get; set; }
Public Property LoadCaseType As AnalysisResult.LoadCaseTypeEnum
	Get
	Set
Property Value
Type: AnalysisResult.LoadCaseTypeEnum
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace